load_tests/image_converter/imgcon-load.test.yml
config:
  target: https://jwezzmu5gd.execute-api.eu-west-1.amazonaws.com/dev
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up phase
    - duration: 10
      arrivalRate: 10
      rampTo: 20
      name: Ramp up phase
    - duration: 10
      arrivalRate: 20
      name: Steady state phase
    - duration: 10
      arrivalRate: 20
      rampTo: 40
      name: Spike phase
  environments:
    r1:
      target: https://rcvqcn57wd.execute-api.eu-west-1.amazonaws.com/r1
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase
    r2:
      target: https://8b0uglw8ze.execute-api.eu-west-1.amazonaws.com/r2
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase
    r3:
      target: https://bbb97jkdik.execute-api.eu-west-1.amazonaws.com/r3
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase
    r4:
      target: https://qo8f4810di.execute-api.eu-west-1.amazonaws.com/r4
      phases:
        - duration: 10
          arrivalRate: 10

scenarios:
  - name: 'google-skateboard'
    weight: 4
    flow:
      - get:
          url: "/600x600/google-skateboard.jpg"
          expect:
            statusCode: 200
  - name: 'desktop-computer.jpg'
    weight: 3
    flow:
      - get:
          url: "/1200x1200/desktop-computer.jpg"
          expect:
            statusCode: 200
  - name: 'desktop-computer.jpg'
    weight: 3
    flow:
      - get:
          url: "/2400x2400/object002.jpeg"
          expect:
            statusCode: 200

output:
  includeOnly:
    - http